#pragma once
#include "../EngineModule/Transform.h"
#include "../MathModule/Matrix.h"

namespace hyunwoo {
	class Camera;
}


/*==================================================================================================================================================================
 *   월드 공간을 랜더링할 때, 기준이 되는 카메라 TransformComponent입니다....
 ***********/
class hyunwoo::Camera final : public TransformComponent
{
	//==================================================================================================
	////////////							  Properties...								////////////////
	//==================================================================================================
public:
	float Fov  = 100.f;
	float Near = 5.f;
	float Far  = 50.f;



	//======================================================================================================
	////////////							  Public methods...								////////////////
	//======================================================================================================
public:
	const Matrix4x4 GetViewMatrix()	const;
	const Matrix4x4 GetPerspectiveMatrix(const float aspectRatio) const;
};


