#pragma once
#include "../EngineModule/Transform.h"
#include "../MathModule/Matrix.h"

namespace hyunwoo {
	class Camera;
	struct ViewPort;
}



/*==================================================================================================================================================================
 *   월드 공간을 랜더링할 때, 기준이 되는 카메라 TransformComponent입니다....
 ***********/
class hyunwoo::Camera final : public TransformComponent
{
	//==================================================================================================
	////////////							  Properties...								////////////////
	//==================================================================================================
public:
	float Fov  = 100.f;
	float Near = 5.f;
	float Far  = 50.f;



	//======================================================================================================
	////////////							  Public methods...								////////////////
	//======================================================================================================
private:
	const Matrix4x4 GetViewMatrix()	const;
	const Matrix4x4 GetPerspectiveMatrix(float ascpectRatio) const;
};








/*==================================================================================================================================================================
 *   화면의 특정 영역을 어떤 해상도로 그릴지를 나타내는 구조체입니다...
 ***********/
struct hyunwoo::ViewPort final
{
	
};